// This query should list the group membership changes. Filtered out based on the administrator account and add only.
IdentityDirectoryEvents
| where ActionType == 'Group Membership changed'
| extend ParsedFields=parse_json(AdditionalFields)
| where ParsedFields contains 'TO.GROUP' and ParsedFields contains 'ACTOR.ACCOUNT'
| extend Administrator = ParsedFields.['ACTOR.ACCOUNT'] 
| extend TargetAccount = ParsedFields.['TARGET_OBJECT.USER']
| extend GroupName = ParsedFields.['TO.GROUP']
| project Timestamp, Administrator, TargetAccount, GroupName
