SecurityEvent 
| where EventID == 5137 
| extend MyData = tostring(parse_xml(EventData))
| extend Administrator = extractjson("$['EventData']['Data'][3]#text", MyData)
| extend GPOLocation = extractjson("$['EventData']['Data'][8]#text", MyData)
| extend ObjectGUID = extractjson("$['EventData']['Data'][9]#text", MyData)
| project Administrator, GPOLocation, ObjectGUID, TimeGenerated
		| join kind= inner (
                    SecurityEvent 
                    | where EventID == 5136 
                    | extend MyData = tostring(parse_xml(EventData))
                    | extend Administrator = extractjson("$['EventData']['Data'][3]#text", MyData)
                    | extend GPOLocation = extractjson("$['EventData']['Data'][8]#text", MyData)
                    | extend ObjectGUID = extractjson("$['EventData']['Data'][9]#text", MyData)
                    | extend GPOName = extractjson("$['EventData']['Data'][13]#text", MyData)
                    | extend DisplayName = extractjson("$['EventData']['Data'][11]#text", MyData)
                    | extend OperationType = extractjson("$['EventData']['Data'][14]#text", MyData)
                    | where DisplayName == "displayName"
                    | where GPOName != "New Group Policy Object"
                    | project ObjectGUID, GPOName
		) on ObjectGUID
		| project-away ObjectGUID1

